posts/notes/Bash-notes/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Bash Note | Warren Liu</title>
<link href="../../../assets/css/rst.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/poole.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/lanyon.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/custom.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="//fonts.googleapis.com/css?family=PT+Serif:400,400italic,700%7CPT+Sans:400">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../rss.xml">
<link rel="canonical" href="https://wudong.graceliu.uk/posts/notes/Bash-notes/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../coding-questions/" title="Coding Questions" type="text/html">
<link rel="next" href="../angular-notes/" title="Angular 2 Note" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="Bash Note">
<meta property="og:url" content="https://wudong.graceliu.uk/posts/notes/Bash-notes/">
<meta property="og:description" content='Table of Contents


Bash array and its loop
Using trap
SIGTERM vs. SIGKILL





Bash array and its loop


declare an array
files=( "/etc/passwd" "/etc/group" "/etc/hosts" )
limits=( 10, 20, 26, 39, 48'>
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-14T16:28:48+01:00">
<meta property="article:tag" content="bash">
</head>
<body>
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>
    <!-- Target for toggling the sidebar `.sidebar-checkbox` is for regular
            styles, `#sidebar-checkbox` for behavior. -->
    <input type="checkbox" class="sidebar-checkbox" id="sidebar-checkbox"><!-- Toggleable sidebar --><div class="sidebar" id="sidebar">
        <div class="sidebar-item">
            <p>A reserved <a href="https://getnikola.com" target="_blank">Nikola</a> theme that places the utmost gravity on content with a hidden drawer. Made by <a href="https://twitter.com/mdo" target="_blank">@mdo</a> for Jekyll,
            ported to Nikola by <a href="https://twitter.com/ralsina" target="_blank">@ralsina</a>.</p>
        </div>
        
    <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../../archive.html">Archive</a>
        <a class="sidebar-nav-item" href="../../../categories/">Tags</a>
        <a class="sidebar-nav-item" href="../../../rss.xml">RSS feed</a>
    
    
    </nav>
</div>

    <!-- Wrap is the content to shift when toggling the sidebar. We wrap the
         content to avoid any CSS collisions with our real content. -->
    <div class="wrap">
      <div class="masthead">
        <div class="container">
          
    <h3 id="brand" class="masthead-title">
      <a href="https://wudong.graceliu.uk/" title="Warren Liu" rel="home">Warren Liu</a>
    </h3>

        </div>
      </div>

      <div class="container content" id="content">
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="post-title p-name entry-title" itemprop="headline name"><a href="." class="u-url">Bash Note</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn">Warren Liu</span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="post-date published dt-published" datetime="2017-07-14T16:28:48+01:00" itemprop="datePublished" title="2017-07-14 16:28">2017-07-14 16:28</time></a></p>
        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Bash array and its loop</a></li>
<li><a href="#sec-2">Using <code>trap</code></a></li>
<li><a href="#sec-3">SIGTERM vs. SIGKILL</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Bash array and its loop</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>declare an array
<div class="highlight"><pre><span></span><span class="nv">files</span><span class="o">=(</span> <span class="s2">"/etc/passwd"</span> <span class="s2">"/etc/group"</span> <span class="s2">"/etc/hosts"</span> <span class="o">)</span>
<span class="nv">limits</span><span class="o">=(</span> <span class="m">10</span>, <span class="m">20</span>, <span class="m">26</span>, <span class="m">39</span>, <span class="m">48</span><span class="o">)</span>
</pre></div>
</li>
<li>array can also be created automatically when a variable is used in
the format like:
<div class="highlight"><pre><span></span>name<span class="o">[</span>index<span class="o">]=</span>value
</pre></div>
</li>
<li>loop through array values
<div class="highlight"><pre><span></span><span class="k">for</span> i in <span class="s2">"</span><span class="si">${</span><span class="nv">arrayName</span><span class="p">[@]</span><span class="si">}</span><span class="s2">"</span>
<span class="k">do</span>
   <span class="nb">echo</span> <span class="nv">$i</span>
<span class="k">done</span>
</pre></div>
<p>
the syntax for array with [@] print out the whole array.
</p>
</li>
<li>get the length of an array with <code>${#array[@]}</code>
<div class="highlight"><pre><span></span><span class="nb">declare</span> -a <span class="nv">Unix</span><span class="o">=(</span><span class="s1">'Debian'</span> <span class="s1">'Red hat'</span> <span class="s1">'Suse'</span> <span class="s1">'Fedora'</span><span class="o">)</span><span class="p">;</span>
<span class="nb">echo</span> <span class="si">${#</span><span class="nv">Unix</span><span class="p">[@]</span><span class="si">}</span> <span class="c1">#Number of elements in the array</span>
<span class="nb">echo</span> <span class="si">${#</span><span class="nv">Unix</span><span class="si">}</span>  <span class="c1">#Number of characters in the first element of the array.i.e Debian</span>
</pre></div>
</li>
<li>get a subarray with <code>${array[@]:3:2}</code>
<div class="highlight"><pre><span></span><span class="nv">Unix</span><span class="o">=(</span><span class="s1">'Debian'</span> <span class="s1">'Ubuntu'</span> <span class="s1">'Fedora'</span> <span class="s1">'UTS'</span> <span class="s1">'OpenLinux'</span><span class="o">)</span><span class="p">;</span>
<span class="nb">echo</span> <span class="si">${</span><span class="nv">Unix</span><span class="p">[@]:</span><span class="nv">3</span><span class="p">:</span><span class="nv">2</span><span class="si">}</span>
</pre></div>
</li>
<li>add an element to an existing array:
<div class="highlight"><pre><span></span><span class="nv">Unix</span><span class="o">=(</span><span class="s1">'Debian'</span> <span class="s1">'Red hat'</span>  <span class="s1">'Fedora'</span> <span class="s1">'UTS'</span> <span class="s1">'OpenLinux'</span><span class="o">)</span><span class="p">;</span>
<span class="nv">Unix</span><span class="o">=(</span><span class="s2">"</span><span class="si">${</span><span class="nv">Unix</span><span class="p">[@]</span><span class="si">}</span><span class="s2">"</span> <span class="s2">"AIX"</span> <span class="s2">"HP-UX"</span><span class="o">)</span>
</pre></div>
</li>
<li>contact two arrays:
<div class="highlight"><pre><span></span><span class="nv">Unix</span><span class="o">=(</span><span class="s1">'Debian'</span> <span class="s1">'Red hat'</span> <span class="s1">'Ubuntu'</span>  <span class="s1">'UTS'</span> <span class="s1">'OpenLinux'</span><span class="o">)</span><span class="p">;</span>
<span class="nv">Shell</span><span class="o">=(</span><span class="s1">'bash'</span> <span class="s1">'csh'</span> <span class="s1">'jsh'</span> <span class="s1">'rc'</span> <span class="s1">'tcsh'</span><span class="o">)</span><span class="p">;</span>
<span class="nv">UnixShell</span><span class="o">=(</span><span class="s2">"</span><span class="si">${</span><span class="nv">Unix</span><span class="p">[@]</span><span class="si">}</span><span class="s2">"</span> <span class="s2">"</span><span class="si">${</span><span class="nv">Shell</span><span class="p">[@]</span><span class="si">}</span><span class="s2">"</span><span class="o">)</span>
<span class="c1"># alternatively, to append the second array to the first</span>
<span class="nv">Unix</span><span class="o">+=</span>Shell
</pre></div>
</li>
<li>remove an element from an array using subarray and contact
</li>
<li>unset can be used to delete an entire array
</li>
<li>bash also support <b>associated arrays</b>:
<div class="highlight"><pre><span></span><span class="nb">declare</span> -A ARRAY <span class="c1"># declar an associate array.</span>
ARRAY<span class="o">[</span>STRING<span class="o">]=</span>VALUE
</pre></div>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Using <code>trap</code>
</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>
<b>trap [COMMANDS] [SIGNALS]</b>: this instructs the <b>trap</b> command to
catch the listed <i>SIGNALS</i>, which my be signal names with or without
the <i>SIG</i> prefix, or signal numbers.
</li>
<li>0, or <i>EXIT</i>, the commands are executed when the shell exists.
</li>
<li>
<i>DEBUG</i>, the list of commands is executed after every simple
command.
</li>
<li>
<i>ERR</i>, the commands is executed each time a simple command exists
with a non-zero status.
</li>
<li>Example:
<div class="highlight"><pre><span></span><span class="ch">#!/bin/bash</span>
<span class="c1"># traptest.sh</span>

<span class="nb">trap</span> <span class="s2">"echo Booh!"</span> SIGINT SIGTERM
<span class="nb">echo</span> <span class="s2">"pid is </span><span class="nv">$$</span><span class="s2">"</span>

<span class="k">while</span> :                 <span class="c1"># This is the same as "while true".</span>
<span class="k">do</span>
	sleep <span class="m">60</span>        <span class="c1"># This script is not really doing anything.</span>
<span class="k">done</span>
</pre></div>
<ul class="org-ul">
<li>In this example, Ctrl+C, or kill with the PID without specifying
the <i>KILL</i> signal, will not terminate the script, cause the
signals is trapped.
</li>
</ul>
</li>
<li>
<b>trap</b> can be used to clean up resource in shell script.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">SIGTERM vs. SIGKILL</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Sending signals to processes using <code>kill</code>
</li>
<li>Anytime you use <code>kill</code> on a process, you are actually sending the
process a signal.
</li>
<li>The full list of signals can be found with <code>kill -l</code>.
</li>
<li>Without any parameters, <code>kill pid</code> would send a <i>SIGTERM</i> signal,
<ul class="org-ul">
<li>in which case:
<ul class="org-ul">
<li>The process may stop immediately.
</li>
<li>The process may stop after a short delay after cleaning up resources.
</li>
<li>The process may keep running indefinitely.
</li>
</ul>
</li>
<li>The application can determine what it want to do once a <i>SIGTERM</i> is
received.
</li>
<li>Also, if the application is in a bad state, such as waiting for disk
I/O, it may not be able to act on the signal that was sent.
</li>
</ul>
</li>
<li>
<code>kill -9 pid</code>: will send a <i>SIGKILL</i>, which cannot be ignored by the
process.
<ul class="org-ul">
<li>The process isn't made aware of the <i>SIGKILL</i> signal since the
signal goes straight to <code>init</code>, which will stop the process.
</li>
<li>The process never gets the opportunity to catch the signal and act
on it.
</li>
</ul>
</li>
<li>
</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/bash/" rel="tag">bash</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../coding-questions/" rel="prev" title="Coding Questions">Previous post</a>
            </li>
            <li class="next">
                <a href="../angular-notes/" rel="next" title="Angular 2 Note">Next post</a>
            </li>
        </ul></nav></aside></article><footer id="footer"><p>Contents © 2017         <a href="mailto:wudong@graceliu.uk">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </div>
    <label for="sidebar-checkbox" class="sidebar-toggle"></label>
    
    
    
            <script src="../../../assets/js/jquery.min.js"></script><script src="../../../assets/js/moment-with-locales.min.js"></script><script src="../../../assets/js/fancydates.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
